app/controllers/articles_controller.rb

  def index
@articles = Article.paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "seventh articles"], ["description", "description of seventh articles"], ["created_at", "2024-11-11 20:17:18.367932"], ["updated_at", "2024-11-11 20:17:18.367932"], ["user_id", 1]]