app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("created_at", "updated_at", "name") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2024-11-12 20:24:05.063383"], ["updated_at", "2024-11-12 20:24:05.063383"], ["name", "Tracking"]]

  def update
    @category = Category.find(params[:id])
    if @category.update(category_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "categories" SET "updated_at" = ?, "name" = ? WHERE "categories"."id" = ?  [["updated_at", "2024-11-13 20:00:04.357290"], ["name", "Travelling"], ["id", 1]]

def index
    @categories = Category.paginate(page: params[:page], per_page: 3)
---
SELECT COUNT(*) FROM "categories"

def show
    @category = Category.find(params[:id])
        @articles = @category.articles.paginate(page: params[:page], per_page: 3)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 1], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]