app/controllers/users_controller.rb

def edit
    @user = User.find(params[:id])end
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]