app/controllers/users_controller.rb

def show
  @articles = @user.articles.paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]

def index
    @users = User.paginate(page: params[:page], per_page: 3)
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["username", "deepak"], ["email", "deepak@example.com"], ["created_at", "2024-11-13 14:43:34.434317"], ["updated_at", "2024-11-13 14:43:34.434317"], ["password_digest", "[FILTERED]"], ["admin", 0]]